tutorials/incompressible/icoFoam/cavityClipped/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices        
(
    (0 0 0)
    (0.6 0 0)
    (0 0.4 0)
    (0.6 0.4 0)
    (1 0.4 0)
    (0 1 0)
    (0.6 1 0)
    (1 1 0)

    (0 0 0.1)
    (0.6 0 0.1)
    (0 0.4 0.1)
    (0.6 0.4 0.1)
    (1 0.4 0.1)
    (0 1 0.1)
    (0.6 1 0.1)
    (1 1 0.1)

);

blocks          
(
    hex (0 1 3 2 8 9 11 10) (12 8 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) (12 12 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (8 12 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall lid 
    (
        (5 13 14 6)
        (6 14 15 7)
    )
    wall fixedWalls 
    (
        (0 8 10 2)
        (2 10 13 5)
        (7 15 12 4)
        (4 12 11 3)
        (3 11 9 1)
        (1 9 8 0) 
    )
    empty frontAndBack 
    (
        (0 2 3 1)
        (2 5 6 3)
        (3 6 7 4)
        (8 9 11 10)
        (10 11 14 13)
        (11 12 15 14)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
